Revit 2027 API
NumberingSchema.AppendSequence Method
Note: This API is now obsolete.
 Appends all elements of one numbering sequence to the end of another sequence.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("<p>This method is deprecated in Revit 2027 and may be removed in a later version of Revit. This function works only for Rebar, Reinforcement and Coupler elements, an exception will be generated if invoked on numbering schemas that scope other categories.</p>")]
public void AppendSequence(
	string fromPartition,
	string toPartition
)
<ObsoleteAttribute("<p>This method is deprecated in Revit 2027 and may be removed in a later version of Revit. This function works only for Rebar, Reinforcement and Coupler elements, an exception will be generated if invoked on numbering schemas that scope other categories.</p>")>
Public Sub AppendSequence (
	fromPartition As String,
	toPartition As String
)
public:
[ObsoleteAttribute(L"<p>This method is deprecated in Revit 2027 and may be removed in a later version of Revit. This function works only for Rebar, Reinforcement and Coupler elements, an exception will be generated if invoked on numbering schemas that scope other categories.</p>")]
void AppendSequence(
	String^ fromPartition,
	String^ toPartition
)
[<ObsoleteAttribute("<p>This method is deprecated in Revit 2027 and may be removed in a later version of Revit. This function works only for Rebar, Reinforcement and Coupler elements, an exception will be generated if invoked on numbering schemas that scope other categories.</p>")>]
member AppendSequence :
        fromPartition : string *
        toPartition : string -> unit
Parameters
fromPartition String
 Name of the partition that determines which numbering sequence to append. The sequence must exist already, otherwise an exception will be thrown.
toPartition String
 Name of a partition into which the source sequence is going to be appended. The sequence must exist already, otherwise an exception will be thrown.
Exceptions
Exception | Condition
ArgumentException |  The sequence fromPartition does not exist in the schema. -or- The sequence toPartition does not exist in the schema. -or- Given partition names fromPartition and toPartition must be different.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Either the schema or its document cannot be modified at present. -or- The input element/s in not a Rebar, an Reinforcement or a Coupler. -or- Thrown if there is an element that cannot have new value of the NUMBER_PARTITION_PARAM parameter assigned. It may be an indication that the element is not free to be edited at present.
Remarks
All numbers assigned to elements in the target sequence remain the same, but numbers in the source sequence (the one getting appended) will change. Elements that match elements in the target sequence will get the same numbers assigned. Remaining elements will get consecutive numbers in the creation order of the elements starting with the next highest number available in the target sequence.
This operation modifies the Partition parameter of all elements in the sequence that is getting appended. Therefore, all its elements must be accessible for editing, otherwise this operation will fail.
Elements can be appended only to a sequence that already exists. In order to reassign elements of one sequence to a partition that does not exist yet, use either the MoveSequence or MergeSequences methods.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace